; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=273, out_folder=./training, instance_id=51, seed=2075, goal_proportion=0.03

(define (problem blocksworld-51)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 - object)
 (:init 
    (arm-empty)
    (clear b266)
    (on b266 b156)
    (on b156 b32)
    (on-table b32)
    (clear b133)
    (on b133 b184)
    (on b184 b26)
    (on-table b26)
    (clear b49)
    (on b49 b149)
    (on b149 b250)
    (on b250 b143)
    (on b143 b267)
    (on b267 b89)
    (on b89 b28)
    (on b28 b23)
    (on b23 b19)
    (on-table b19)
    (clear b157)
    (on b157 b103)
    (on-table b103)
    (clear b70)
    (on b70 b33)
    (on b33 b186)
    (on b186 b16)
    (on b16 b201)
    (on-table b201)
    (clear b159)
    (on-table b159)
    (clear b147)
    (on-table b147)
    (clear b101)
    (on b101 b62)
    (on-table b62)
    (clear b67)
    (on b67 b45)
    (on b45 b253)
    (on b253 b52)
    (on b52 b122)
    (on b122 b129)
    (on b129 b217)
    (on b217 b179)
    (on-table b179)
    (clear b166)
    (on b166 b146)
    (on b146 b54)
    (on b54 b126)
    (on b126 b87)
    (on-table b87)
    (clear b137)
    (on b137 b71)
    (on b71 b158)
    (on b158 b14)
    (on b14 b200)
    (on b200 b2)
    (on b2 b236)
    (on b236 b247)
    (on b247 b181)
    (on b181 b172)
    (on-table b172)
    (clear b192)
    (on-table b192)
    (clear b225)
    (on-table b225)
    (clear b104)
    (on b104 b37)
    (on b37 b123)
    (on-table b123)
    (clear b215)
    (on b215 b199)
    (on b199 b202)
    (on b202 b218)
    (on b218 b80)
    (on b80 b58)
    (on-table b58)
    (clear b39)
    (on b39 b237)
    (on-table b237)
    (clear b252)
    (on b252 b242)
    (on b242 b74)
    (on b74 b42)
    (on-table b42)
    (clear b268)
    (on b268 b92)
    (on-table b92)
    (clear b211)
    (on-table b211)
    (clear b219)
    (on b219 b246)
    (on b246 b61)
    (on b61 b90)
    (on-table b90)
    (clear b213)
    (on-table b213)
    (clear b106)
    (on b106 b10)
    (on b10 b11)
    (on-table b11)
    (clear b220)
    (on-table b220)
    (clear b59)
    (on b59 b228)
    (on-table b228)
    (clear b148)
    (on-table b148)
    (clear b205)
    (on-table b205)
    (clear b50)
    (on b50 b13)
    (on b13 b108)
    (on b108 b55)
    (on b55 b51)
    (on b51 b118)
    (on b118 b238)
    (on b238 b12)
    (on b12 b86)
    (on b86 b41)
    (on b41 b206)
    (on b206 b273)
    (on b273 b81)
    (on b81 b15)
    (on b15 b254)
    (on b254 b227)
    (on-table b227)
    (clear b83)
    (on b83 b114)
    (on b114 b94)
    (on b94 b222)
    (on b222 b195)
    (on-table b195)
    (clear b263)
    (on b263 b167)
    (on b167 b96)
    (on-table b96)
    (clear b272)
    (on b272 b175)
    (on b175 b234)
    (on b234 b239)
    (on b239 b188)
    (on-table b188)
    (clear b88)
    (on b88 b21)
    (on b21 b141)
    (on b141 b160)
    (on b160 b198)
    (on b198 b231)
    (on b231 b8)
    (on b8 b196)
    (on b196 b18)
    (on b18 b216)
    (on b216 b194)
    (on b194 b107)
    (on b107 b171)
    (on-table b171)
    (clear b43)
    (on b43 b174)
    (on b174 b223)
    (on-table b223)
    (clear b232)
    (on b232 b119)
    (on b119 b154)
    (on-table b154)
    (clear b100)
    (on b100 b142)
    (on b142 b269)
    (on b269 b230)
    (on b230 b131)
    (on b131 b68)
    (on b68 b270)
    (on b270 b75)
    (on b75 b127)
    (on-table b127)
    (clear b57)
    (on b57 b7)
    (on b7 b109)
    (on-table b109)
    (clear b259)
    (on b259 b180)
    (on b180 b191)
    (on b191 b190)
    (on b190 b77)
    (on b77 b63)
    (on-table b63)
    (clear b189)
    (on-table b189)
    (clear b102)
    (on-table b102)
    (clear b30)
    (on b30 b240)
    (on b240 b261)
    (on-table b261)
    (clear b132)
    (on b132 b48)
    (on b48 b69)
    (on b69 b255)
    (on b255 b121)
    (on-table b121)
    (clear b124)
    (on-table b124)
    (clear b111)
    (on b111 b265)
    (on b265 b91)
    (on b91 b164)
    (on-table b164)
    (clear b170)
    (on b170 b115)
    (on b115 b185)
    (on-table b185)
    (clear b140)
    (on b140 b233)
    (on b233 b151)
    (on b151 b1)
    (on b1 b178)
    (on b178 b150)
    (on-table b150)
    (clear b183)
    (on b183 b24)
    (on b24 b152)
    (on b152 b20)
    (on b20 b44)
    (on b44 b235)
    (on b235 b46)
    (on b46 b210)
    (on-table b210)
    (clear b35)
    (on b35 b128)
    (on-table b128)
    (clear b53)
    (on b53 b98)
    (on-table b98)
    (clear b243)
    (on b243 b130)
    (on-table b130)
    (clear b153)
    (on b153 b29)
    (on b29 b3)
    (on b3 b224)
    (on-table b224)
    (clear b144)
    (on b144 b208)
    (on b208 b169)
    (on-table b169)
    (clear b251)
    (on-table b251)
    (clear b105)
    (on b105 b177)
    (on b177 b203)
    (on b203 b135)
    (on-table b135)
    (clear b25)
    (on b25 b163)
    (on b163 b161)
    (on b161 b56)
    (on-table b56)
    (clear b264)
    (on b264 b82)
    (on b82 b17)
    (on b17 b244)
    (on-table b244)
    (clear b262)
    (on b262 b60)
    (on b60 b241)
    (on b241 b93)
    (on b93 b6)
    (on b6 b125)
    (on b125 b31)
    (on b31 b110)
    (on b110 b271)
    (on-table b271)
    (clear b245)
    (on b245 b99)
    (on b99 b176)
    (on-table b176)
    (clear b138)
    (on b138 b257)
    (on b257 b173)
    (on-table b173)
    (clear b113)
    (on-table b113)
    (clear b258)
    (on b258 b66)
    (on b66 b36)
    (on b36 b38)
    (on-table b38)
    (clear b134)
    (on b134 b165)
    (on b165 b136)
    (on b136 b85)
    (on-table b85)
    (clear b155)
    (on b155 b162)
    (on b162 b79)
    (on-table b79)
    (clear b116)
    (on b116 b84)
    (on b84 b5)
    (on b5 b78)
    (on b78 b197)
    (on b197 b212)
    (on b212 b9)
    (on b9 b34)
    (on b34 b4)
    (on b4 b209)
    (on b209 b182)
    (on-table b182)
    (clear b248)
    (on b248 b112)
    (on-table b112)
    (clear b65)
    (on-table b65)
    (clear b229)
    (on b229 b22)
    (on b22 b72)
    (on-table b72)
    (clear b73)
    (on-table b73)
    (clear b214)
    (on b214 b193)
    (on b193 b139)
    (on b139 b256)
    (on b256 b221)
    (on b221 b95)
    (on b95 b204)
    (on b204 b145)
    (on b145 b187)
    (on-table b187)
    (clear b117)
    (on b117 b76)
    (on b76 b97)
    (on-table b97)
    (clear b260)
    (on b260 b27)
    (on-table b27)
    (clear b64)
    (on b64 b47)
    (on b47 b40)
    (on b40 b226)
    (on b226 b120)
    (on b120 b249)
    (on b249 b207)
    (on b207 b168)
    (on-table b168))
 (:goal  (and 
    (clear b1)
    (on b1 b3)
    (on b3 b7)
    (on b7 b4)
    (on b4 b5)
    (on-table b5)
    (clear b6)
    (on-table b6)
    (clear b2)
    (on b2 b8)
    (on-table b8))))

; plan
1. (unstack b116 b84)
   deleted: (on b116 b84) (clear b116) (arm-empty)
   added: (holding b116) (clear b84)
   goals met: 0 of 11
2. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 0 of 11
3. (unstack b137 b71)
   deleted: (on b137 b71) (clear b137) (arm-empty)
   added: (holding b137) (clear b71)
   goals met: 0 of 11
4. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 0 of 11
5. (unstack b140 b233)
   deleted: (on b140 b233) (clear b140) (arm-empty)
   added: (holding b140) (clear b233)
   goals met: 0 of 11
6. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 0 of 11
7. (unstack b153 b29)
   deleted: (on b153 b29) (clear b153) (arm-empty)
   added: (holding b153) (clear b29)
   goals met: 0 of 11
8. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 0 of 11
9. (unstack b233 b151)
   deleted: (on b233 b151) (clear b233) (arm-empty)
   added: (holding b233) (clear b151)
   goals met: 0 of 11
10. (putdown b233)
   deleted: (holding b233)
   added: (clear b233) (arm-empty) (on-table b233)
   goals met: 0 of 11
11. (unstack b151 b1)
   deleted: (on b151 b1) (clear b151) (arm-empty)
   added: (holding b151) (clear b1)
   goals met: 1 of 11
12. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 1 of 11
13. (unstack b262 b60)
   deleted: (on b262 b60) (clear b262) (arm-empty)
   added: (holding b262) (clear b60)
   goals met: 1 of 11
14. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 1 of 11
15. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 1 of 11
16. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 11
17. (unstack b57 b7)
   deleted: (on b57 b7) (clear b57) (arm-empty)
   added: (holding b57) (clear b7)
   goals met: 1 of 11
18. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 1 of 11
19. (unstack b60 b241)
   deleted: (on b60 b241) (clear b60) (arm-empty)
   added: (holding b60) (clear b241)
   goals met: 1 of 11
20. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 1 of 11
21. (unstack b241 b93)
   deleted: (on b241 b93) (clear b241) (arm-empty)
   added: (holding b241) (clear b93)
   goals met: 1 of 11
22. (putdown b241)
   deleted: (holding b241)
   added: (clear b241) (arm-empty) (on-table b241)
   goals met: 1 of 11
23. (unstack b71 b158)
   deleted: (on b71 b158) (clear b71) (arm-empty)
   added: (holding b71) (clear b158)
   goals met: 1 of 11
24. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 1 of 11
25. (unstack b158 b14)
   deleted: (on b158 b14) (clear b158) (arm-empty)
   added: (holding b158) (clear b14)
   goals met: 1 of 11
26. (putdown b158)
   deleted: (holding b158)
   added: (clear b158) (arm-empty) (on-table b158)
   goals met: 1 of 11
27. (unstack b14 b200)
   deleted: (on b14 b200) (clear b14) (arm-empty)
   added: (holding b14) (clear b200)
   goals met: 1 of 11
28. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 11
29. (unstack b200 b2)
   deleted: (on b200 b2) (clear b200) (arm-empty)
   added: (holding b200) (clear b2)
   goals met: 2 of 11
30. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 2 of 11
31. (unstack b84 b5)
   deleted: (on b84 b5) (clear b84) (arm-empty)
   added: (holding b84) (clear b5)
   goals met: 2 of 11
32. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 2 of 11
33. (unstack b5 b78)
   deleted: (on b5 b78) (clear b5) (arm-empty)
   added: (holding b5) (clear b78)
   goals met: 2 of 11
34. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 11
35. (unstack b78 b197)
   deleted: (on b78 b197) (clear b78) (arm-empty)
   added: (holding b78) (clear b197)
   goals met: 3 of 11
36. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 3 of 11
37. (unstack b197 b212)
   deleted: (on b197 b212) (clear b197) (arm-empty)
   added: (holding b197) (clear b212)
   goals met: 3 of 11
38. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 3 of 11
39. (unstack b212 b9)
   deleted: (on b212 b9) (clear b212) (arm-empty)
   added: (holding b212) (clear b9)
   goals met: 3 of 11
40. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 3 of 11
41. (unstack b88 b21)
   deleted: (on b88 b21) (clear b88) (arm-empty)
   added: (holding b88) (clear b21)
   goals met: 3 of 11
42. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 3 of 11
43. (unstack b21 b141)
   deleted: (on b21 b141) (clear b21) (arm-empty)
   added: (holding b21) (clear b141)
   goals met: 3 of 11
44. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 3 of 11
45. (unstack b141 b160)
   deleted: (on b141 b160) (clear b141) (arm-empty)
   added: (holding b141) (clear b160)
   goals met: 3 of 11
46. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 3 of 11
47. (unstack b160 b198)
   deleted: (on b160 b198) (clear b160) (arm-empty)
   added: (holding b160) (clear b198)
   goals met: 3 of 11
48. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 3 of 11
49. (unstack b198 b231)
   deleted: (on b198 b231) (clear b198) (arm-empty)
   added: (holding b198) (clear b231)
   goals met: 3 of 11
50. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 3 of 11
51. (unstack b231 b8)
   deleted: (on b231 b8) (clear b231) (arm-empty)
   added: (holding b231) (clear b8)
   goals met: 3 of 11
52. (putdown b231)
   deleted: (holding b231)
   added: (clear b231) (arm-empty) (on-table b231)
   goals met: 3 of 11
53. (unstack b8 b196)
   deleted: (on b8 b196) (clear b8) (arm-empty)
   added: (holding b8) (clear b196)
   goals met: 3 of 11
54. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 11
55. (unstack b9 b34)
   deleted: (on b9 b34) (clear b9) (arm-empty)
   added: (holding b9) (clear b34)
   goals met: 4 of 11
56. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 4 of 11
57. (unstack b34 b4)
   deleted: (on b34 b4) (clear b34) (arm-empty)
   added: (holding b34) (clear b4)
   goals met: 4 of 11
58. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 4 of 11
59. (unstack b93 b6)
   deleted: (on b93 b6) (clear b93) (arm-empty)
   added: (holding b93) (clear b6)
   goals met: 5 of 11
60. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 5 of 11
61. (unstack b6 b125)
   deleted: (on b6 b125) (clear b6) (arm-empty)
   added: (holding b6) (clear b125)
   goals met: 4 of 11
62. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 11
63. (unstack b4 b209)
   deleted: (on b4 b209) (clear b4) (arm-empty)
   added: (holding b4) (clear b209)
   goals met: 6 of 11
64. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 7 of 11
65. (unstack b7 b109)
   deleted: (on b7 b109) (clear b7) (arm-empty)
   added: (holding b7) (clear b109)
   goals met: 7 of 11
66. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 8 of 11
67. (unstack b3 b224)
   deleted: (on b3 b224) (clear b3) (arm-empty)
   added: (holding b3) (clear b224)
   goals met: 8 of 11
68. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 9 of 11
69. (unstack b1 b178)
   deleted: (on b1 b178) (clear b1) (arm-empty)
   added: (holding b1) (clear b178)
   goals met: 8 of 11
70. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 10 of 11
71. (unstack b2 b236)
   deleted: (on b2 b236) (clear b2) (arm-empty)
   added: (holding b2) (clear b236)
   goals met: 9 of 11
72. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 11 of 11
